src/cf/Catalogs/КодыВидовПодакцизныхТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>КодыВидовПодакцизныхТоваров</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидТовара</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПодакцизныхТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДействуетС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДействуетПо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/КодыВидовПодакцизныхТоваров/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

Процедура НайтиСоздатьКодыПодакцихТоваров(ВидТовара) Экспорт
	
	Макет = Справочники.КодыВидовПодакцизныхТоваров.ПолучитьМакет("КлассификаторКодов");
	ОбластьПоВидуТовара = Макет.Области.Найти(СтрЗаменить(ВидТовара, " ", ""));
	Если ОбластьПоВидуТовара <> Неопределено Тогда
		ОбластьПоВидуТовара = Макет.ПолучитьОбласть(СтрЗаменить(ВидТовара, " ", ""));
		Запрос = Новый Запрос();
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	КодыВидовПодакцизныхТоваров.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.КодыВидовПодакцизныхТоваров КАК КодыВидовПодакцизныхТоваров
		|ГДЕ
		|	КодыВидовПодакцизныхТоваров.ВидТовара = &ВидТовара
		|	И КодыВидовПодакцизныхТоваров.ПометкаУдаления = ЛОЖЬ";
		Запрос.УстановитьПараметр("ВидТовара", ВидТовара);
		Результат = Запрос.Выполнить().Выбрать();
		Если Результат.Следующий() Тогда
			Возврат;
		КонецЕсли;
		
		КолвоСтрок = ОбластьПоВидуТовара.ВысотаТаблицы;
		Для Стр = 1 По КолВоСтрок Цикл
			КодВида = ОбластьПоВидуТовара.Область(Стр, 1);
			ВидПодакцизногоТовара = Справочники.КодыВидовПодакцизныхТоваров.НайтиПоКоду(КодВида.Текст);
			Если ВидПодакцизногоТовара = Неопределено Или ВидПодакцизногоТовара = Справочники.КодыВидовПодакцизныхТоваров.ПустаяСсылка() Тогда
				НовыйВид = Справочники.КодыВидовПодакцизныхТоваров.СоздатьЭлемент();
				НовыйВид.Код                = КодВида.Текст;
				НовыйВид.Наименование       = ОбластьПоВидуТовара.Область(Стр, 3).Текст;
				НовыйВид.НаименованиеПолное = ОбластьПоВидуТовара.Область(Стр, 2).Текст;
				НовыйВид.ВидТовара          = ВидТовара;
				НовыйВид.Записать();
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
